test/vcr/vcr_cassettes/cities_by_country_basic_call.yml

---
http_interactions:
- request:
    method: post
    uri: http://www.webservicex.net/globalweather.asmx
    body:
      encoding: US-ASCII
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://www.webserviceX.NET"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:GetCitiesByCountry><tns:CountryName>Germany</tns:CountryName></tns:GetCitiesByCountry></env:Body></env:Envelope>
    headers:
      Soapaction:
      - ! '"http://www.webserviceX.NET/GetCitiesByCountry"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '371'
      Accept:
      - ! '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private, max-age=0
      Content-Length:
      - '12518'
      Content-Type:
      - text/xml; charset=utf-8
      Server:
      - Microsoft-IIS/7.0
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Sun, 25 Aug 2013 03:53:36 GMT
    body:
      encoding: US-ASCII
      string: ! "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"
        xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><GetCitiesByCountryResponse
        xmlns=\"http://www.webserviceX.NET\"><GetCitiesByCountryResult>&lt;NewDataSet&gt;\r\n
        \ &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Berlin-Schoenefeld&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Dresden-Klotzsche&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Erfurt-Bindersleben&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Frankfurt / M-Flughafen&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n
        \ &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Muenster
        / Osnabrueck&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Hamburg-Fuhlsbuettel&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n
        \ &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Berlin-Tempelhof&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Koeln / Bonn&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Duesseldorf&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Munich / Riem&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Nuernberg&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Leipzig-Schkeuditz&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Saarbruecken
        / Ensheim&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Stuttgart-Echterdingen&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n
        \ &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Berlin-Tegel&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Hannover&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Bremen&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Hahn&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Baden Wurttemberg,
        Neuostheim&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Hamburg-Finkenwerder&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n
        \ &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Luebeck-Blankensee&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Monchengladbach&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Paderborn /
        Lippstadt&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Dortmund / Wickede&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Augsburg&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Oberpfaffenhofen&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Friedrichshafen&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Mecklenburg-Vorpommern, Parchim&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n
        \ &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Bayreuth&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Hof&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Konstanz&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Braunschweig&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Kassel / Calden&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Lemwerder&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Westerland /
        Sylt&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Essen&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Spangdahlem&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Ramstein&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Sembach United
        States Air Force&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Aachen / Merzbruck&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Ansbach / Katterbach&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Bad Kreuznach&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Giebelstadt&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Bergen&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Gluecksburg
        / Meierwik&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Idar-Oberstein&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Kuemmersruck&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Wittstock&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Kalkar&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Messstetten&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Altenstadt&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Bueckeburg&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Celle&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Rheine-Bentlage&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Fritzlar&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Itzehoe&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Laupheim&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Mendig&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Niederstetten&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Roth&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Fassberg&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Cottbus Flugplatz&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Grafenwoehr&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Hanau&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Heidelberg&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Hohenfels&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Illesheim&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Kitzingen Usa  Af&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Eggebek&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Kiel-Holtenau&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Nordholz&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Diepholz&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Geilenkirchen&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Hohn&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Jever&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Laage&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Noervenich&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Hopsten&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Preschen&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Schleswig-Jagel&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Wittmundhaven&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Trollenhagen&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Wunstorf&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Coleman Mannheim&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Wiesbaden&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Landsberg&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Buechel&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Erding&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Fuerstenfeldbruck&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Holzdorf&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Ingolstadt&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Lechfeld&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Memmingen&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Neuburg / Donau&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Pferdsfeld&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Laarbruch&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Nordhorn&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n    &lt;Country&gt;Germany&lt;/Country&gt;\r\n
        \   &lt;City&gt;Guetersloh&lt;/City&gt;\r\n  &lt;/Table&gt;\r\n  &lt;Table&gt;\r\n
        \   &lt;Country&gt;Germany&lt;/Country&gt;\r\n    &lt;City&gt;Brueggen&lt;/City&gt;\r\n
        \ &lt;/Table&gt;\r\n&lt;/NewDataSet&gt;</GetCitiesByCountryResult></GetCitiesByCountryResponse></soap:Body></soap:Envelope>"
    http_version: 
  recorded_at: Sun, 25 Aug 2013 03:53:34 GMT
recorded_with: VCR 2.5.0
