serz/soap.tab.objects

{"Tue Jun 09 18:10:22 MSK 2015":{"requestArea":"<?xml version=\"1.0\" encoding=\"UTF-8\" ?>\n<s12:Envelope xmlns:s12='http://www.w3.org/2003/05/soap-envelope'>\n  <s12:Body>\n    <ns1:GetWeather xmlns:ns1='http://www.webserviceX.NET'>\n      <ns1:CityName>paramValue</ns1:CityName>\n      <ns1:CountryName>paramValue</ns1:CountryName>\n    </ns1:GetWeather>\n  </s12:Body>\n</s12:Envelope>","requestUrlField":"http://vkhozhaynov:4648/mock","projectNameField":"Weather Project","responseArea":"<?xml version=\"1.0\" encoding=\"UTF-8\"?><soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:web=\"http://www.webserviceX.NET\">\n   <soap:Header/>\n   <soap:Body>\n      <web:GetCitiesByCountryResponse>\n         <!--Optional:-->\n         <web:GetCitiesByCountryResult>?</web:GetCitiesByCountryResult>\n      </web:GetCitiesByCountryResponse>\n   </soap:Body>\n</soap:Envelope>","wsdlField":"http://www.webservicex.com/globalweather.asmx?WSDL"}}